Repository: covistefan/woo-paypal-data-request
Catalog: languages/woo-paypal-data-request-*.po
Languages: de_de

source: Save
de_de: Speichern

source: General settings
de_de: Allgemeine Einstellungen

source: Getting codes
de_de: Codes abrufen

source: Embedding preferences
de_de: Einbettung

source: Helpdesc
de_de: Hilfe

source: You can define here, which pages/elements will show up the codelist.
de_de: Du kannst hier definieren, auf welchen Seiten die Codeliste angezeigt werden soll.

source: Successful Checkout
de_de: Kauf abgeschlossen

source: Determine whether the code list should be displayed after successful checkout. The list is only displayed if the status of the order is `complete`.
de_de: Aktiviere die Anzeige der Codeliste nach erfolgreichem Kauf. Die Liste wird nur angezeigt, wenn der Status der Bestellung „Abgeschlossen“ ist.

source: Email support
de_de: E-Mail

source: Setup whether the code list should be sent by email within the order confirmation.
de_de: Aktiviere die Anzeige der Codeliste in der Bestätigungs- bzw. Abschlussemail.

source: Override completed
de_de: Übergehe ‚Abgeschlossen‘

source: Determine whether the code list should be displayed on the thank you page, regardless of the further status of the order. Make sure you only offer payment options that have been successfully completed at this time.
de_de: Aktiviere die Anzeige der Codeliste unabhängig vom Status der Bestellung. Stelle aber besser sicher, dass zu diesem Zeitpunkt wirklich für die Codes bezahlt wurdest.

source: Setup whether the code list should be shown in order details page for admin.
de_de: Aktiviere die Anzeige der Codeliste auf der Bestellübersichtsseite im Admin-Panel.

source: Settings
de_de: Einstellungen

source: API usage
de_de: API Benutzung

source: Enable or disable code API usage for WooCommerce Checkout
de_de: Aktiviere/Deaktiviere die Nutzung der Codelist-API für WooCommerce

source: API DEV Mode
de_de: API Entwickler Modus

source: Enable or disable code API development mode. Development mode will show up more returning information in admin panel.
de_de: Der API Entwickler Modus bietet die Anzeige weiterer Informationen aus der Kommunikation zwischen Wordpress und dem API-Server im Admin-Panel.

source: Select data submit type
de_de: Wähle, wie die Daten zur API übermittelt werden

source: Choose what method should be used to send data to API
de_de: Wähle, welche Methode benutzt werden soll, um die API anzusprechen

source: Select data submit format
de_de: Wähle das Format, in dem Daten übermittelt werden

source: POST - data will be submitted as post values, JSON - ONE single string with a JSON-encoded dataset will be submitted
de_de: POST-Daten werden als Array übermittelt, JSON-Daten werden vorher per JSON-Encode verarbeitet und dann als einzelner String geschickt

source: Select data return type
de_de: Wähle den Rückgabetyp der API-Daten

source: Choose what kind of data you expext to be returned from API
de_de: Wähle, welche Daten du als Rückgabe von der API erwartest

source: How does Woo Code API work?
de_de: Wie arbeitet die Woo Code API?

source: Woo Code API submits your product data to an external server you defined in "Get Codes"
de_de: Die Woo Code API übermittelt deine Produktdaten an einen externen Server, den du im Bereich „Codes abrufen“ definieren kannst.

source: Data submitted
de_de: Daten, die übertragen werden

source: If API-Key-Authentification is set, the params <code>api-client</code> and <code>api-token</code> will be sent as <code>CURLOPT_HTTPHEADER</code> with their associated data.
de_de: Wenn die API-Schlüssel-Authentifizierung aktiviert ist, werden die Parameter <code>api-client</code> und <code>api-token</code> als <code>HTTP-Header</code> mit den entsprechenden Daten übermittelt.

source: If an action param is set, it will be submitted as <code>action</code>.
de_de: Der „API-Aktion“-Parameter wird als <code>action</code>-Variable mitgeschickt, wenn er gesetzt ist.

source: For <strong>each</strong> product will be created a single entry. If your customer bought 2 variants of the same product, 2 codes expected to be returned.
de_de: Für <strong>jedes</strong> Produkt wird ein einzelner Eintrag erzeugt. Wenn dein Kunde also zwei Varianten des selben Produktes kauft, werden auch zwei Codes zurück erwartet.

source: Every product set submitted to API has following structure:
de_de: Jeder Produktdatensatz, der übertragen wird, hat den folgenden Aufbau:

source: submitting
de_de: datensatz

source: Items order ID
de_de: Bestellnummer des Elements

source: Items product ID
de_de: Produkt-ID des Elements

source: Items variation ID
de_de: Varianten-ID des Elements

source: Items sku
de_de: Artikelnummer des Elements

source: Complete set sent to your API example (click to show)
de_de: Beispiel für einen kompletten Datensatz, der an die API geschickt wird (Klicke zum Anzeigen)

source: Data expected
de_de: Daten, die zurückerwartet werden

source: The expected returning data for XML or JSON is a set of data with same length like product set and <code>n</code> elements with key <code>code</code> and a string as value that holds the full information that should be returned as code:
de_de: Die erwartete Rückgabe für XML oder JSON ist ein Datensatz mit der selben Länge wie der Produktdatensatz und <code>n</code> Elementen mit dem Schlüsselwert <code>code</code> und einem string als Wert, der die komplette Information zum Code enthält, die dem Benutzer angezeigt werden soll:

source: returning
de_de: rueckgabe

source: The expected returning data for string format is just a list of codes, separeted by semikolon:
de_de: Die erwartete Rückgabe für einen STRING ist eine Liste von Codes, getrennt von einem Semikolon:

source: Complete set returned from API example (click to show)
de_de: Beispiel für einen kompletten Datensatz von der API (Klicke zum Anzeigen)

source: Getting Codes
de_de: Codes abrufen

source: Tell API, where from and how to request a new code.
de_de: Definiere hier, woher - und wie - die API neue Codes anfordern kann.

source: Is an authentication to API required?
de_de: Ist eine Authentifizierung erforderlich?

source: Authentication Type
de_de: Authentifizierungstyp

source: none
de_de: Keine

source: Basic Authentication
de_de: Standardauthentifizierung

source: API-Key Authentication
de_de: API-Schlüssel-Authentifizierung

source: Basic authentication works as known `user:pass` combination, API-Key-Authentication works with HTTP-header `api-client` and HTTP-header `api-key`
de_de: Die Standardauthentifizierung arbeitet mit der bekannten `benutzer:passwort` Kombination, die API-Schlüssel-Authentifizierung schickt die HTTP-Header `api-client` und `api-key`

source: Auth user
de_de: Auth Benutzer

source: API-Client
de_de: API-Benutzername

source: Auth pass
de_de: Auth Passwort

source: API-Key
de_de: API-Schlüssel

source: API-Action
de_de: API-Aktion

source: API-Action is an optional parameter telling the API, what shall be returned, value will be sent as parameter `action` in JSON-string or fieldname `action` in POST-array.
de_de: Der "API-Aktion"-Parameter wird als `action`-Variable mitgeschickt und kann der API so sagen, welche Daten zurückgeschickt werden sollen.

source: URL, that the cURL-request will be sent to.
de_de: URL, an die die Anforderung gesendet wird.

source: Returning data had to much values
de_de: Der zurückgegebene Datensatz hatte zu viele Werte

source: Returning data count did not match requestest data count
de_de: Die zurückgegebenen Daten entsprachen nicht der erwarteten Datenmenge

source: There was no data returned
de_de: Es wurden keine Daten zurückgegeben

source: Strings as return are not supported yet
de_de: STRINGS sind als Rückgabewert derzeit noch nicht implementiert

source: Codelist API got no host to connect
de_de: Es wurde kein Host definiert, zu dem sich die API verbinden soll

source: Your codes
de_de: Deine Codes

source: Product
de_de: Produkt

source: Error requesting codelist API
de_de: Fehler beim Anfordern der Codelisten-API

source: Code API for WooCommerce Checkout
de_de: Code API für die WooCommerce Bestellseite

source: %1$s is ineffective as it requires %2$s to be installed and active.
de_de: %1$s benötigt eine aktive Installation von %2$s.

source: Code API for Checkout in WooCommerce
de_de: Code API für die WooCommerce Bestellseite

source: This plugin adds support for returning digital codes from external service after successful payment provided by an API
de_de: Dieses Plugin erweitert WooCommerce um die Möglichkeit, digitale Codes über eine externe API abzurufen und dem Käufer nach Kaufabschluss bereit zu stellen
